In [1]:
#programmer name : Parth Nirmal
#college : Keystone school of engg.
#class : TE(B)
#Roll no : 12

In [2]:
import pandas as pd

In [4]:
df = pd.read_csv("student.csv")
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [5]:
x = df.iloc[0:5,2:4]
print(x)

  class  marks
0    TE  56.77
1    TE  59.77
2    BE  76.88
3    TE  69.66
4    TE  63.28

In [11]:
y = df.iloc[5:,2:]
print(y)

  class  marks  age
5    BE  49.55   20
6    BE  65.34   19
7    BE  68.33   23
8    TE  56.75   20
9    BE  78.66   21

In [13]:
df.iloc[:4,:2]

   roll     name
0     1     anil
1     2     amit
2     3   aniket
3     4  ajinkya

In [14]:
df.iloc[:,:]

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [16]:
type(x)

pandas.core.frame.DataFrame

In [20]:
df.iloc[[1,3,4,5,6],3:5]

   marks  age
1  59.77   21
3  69.66   20
4  63.28   20
5  49.55   20
6  65.34   19

In [24]:
df.iloc[[1,3,4,5,6],[1,3,4]]

      name  marks  age
1     amit  59.77   21
3  ajinkya  69.66   20
4     asha  63.28   20
5   ayesha  49.55   20
6     amar  65.34   19

In [27]:
df.iloc[5]

roll          6
name     ayesha
class        BE
marks     49.55
age          20
Name: 5, dtype: object

In [41]:
df.iloc[6,1]

'amar'

In [37]:
df.iloc[1,3]

59.77

In [42]:
df.loc[:,"name"]

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [44]:
df.loc[0:5,"marks"]

0    56.77
1    59.77
2    76.88
3    69.66
4    63.28
5    49.55
Name: marks, dtype: float64

In [45]:
df.loc[0:5,"class"]

0    TE
1    TE
2    BE
3    TE
4    TE
5    BE
Name: class, dtype: object

In [46]:
df.loc[0:5,"roll":"marks"]

   roll     name class  marks
0     1     anil    TE  56.77
1     2     amit    TE  59.77
2     3   aniket    BE  76.88
3     4  ajinkya    TE  69.66
4     5     asha    TE  63.28
5     6   ayesha    BE  49.55

In [49]:
df.loc[5:,["roll","marks","age"]]

   roll  marks  age
5     6  49.55   20
6     7  65.34   19
7     8  68.33   23
8     9  56.75   20
9    10  78.66   21

In [50]:
df.loc[5]

roll          6
name     ayesha
class        BE
marks     49.55
age          20
Name: 5, dtype: object

In [55]:
df[['name','marks','age']]

      name  marks  age
0     anil  56.77   22
1     amit  59.77   21
2   aniket  76.88   19
3  ajinkya  69.66   20
4     asha  63.28   20
5   ayesha  49.55   20
6     amar  65.34   19
7    amita  68.33   23
8     amol  56.75   20
9    anmol  78.66   21

In [56]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [57]:
df.age

0    22
1    21
2    19
3    20
4    20
5    20
6    19
7    23
8    20
9    21
Name: age, dtype: int64

In [58]:
df.drop(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19
4     5    asha    TE  63.28   20
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [60]:
list(range(5))+list(range(6,10))

[0, 1, 2, 3, 4, 6, 7, 8, 9]

In [62]:
df.drop([1,4])

   roll     name class  marks  age
0     1     anil    TE  56.77   22
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [64]:
df.drop("name",axis=1)

   roll class  marks  age
0     1    TE  56.77   22
1     2    TE  59.77   21
2     3    BE  76.88   19
3     4    TE  69.66   20
4     5    TE  63.28   20
5     6    BE  49.55   20
6     7    BE  65.34   19
7     8    BE  68.33   23
8     9    TE  56.75   20
9    10    BE  78.66   21

In [65]:
df["marks"].mean()

64.499

In [67]:
df["age"].max()

23

In [68]:
df["marks"].min()

49.55

In [69]:
df["age"].sum()

205

In [70]:
df["name"].min()

'ajinkya'

In [71]:
df['age'].value_counts()

age
20    4
21    2
19    2
22    1
23    1
Name: count, dtype: int64

In [73]:
df['age'].mode()

0    20
Name: age, dtype: int64

In [74]:
df["marks"].count()

10

In [75]:
df.min()

roll           1
name     ajinkya
class         BE
marks      49.55
age           19
dtype: object

In [77]:
df.mean(numeric_only = True)

roll      5.500
marks    64.499
age      20.500
dtype: float64

df.std(numeric_only = True)

In [78]:
df.std(numeric_only = True)

roll     3.027650
marks    9.207179
age      1.269296
dtype: float64

In [79]:
df.std(numeric_only = True,axis=1)

0    28.166901
1    29.443408
2    38.868043
3    34.237774
4    30.261959
5    22.232877
6    30.808417
7    31.409971
8    25.005416
9    36.877887
dtype: float64

In [80]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000